{
  "ingredients": 
  [
    {
      "amount": 2,
      "name": "dried ancho chili peppers"
    },
    {
      "amount": 2,
      "units": "cups",
      "name": "boiling water"
    },
    {
      "amount": 2,
      "units": "tbsp",
      "name": "pumpkin seeds"
    },
    {
      "amount": 1,
      "units": "tbsp",
      "name": "cumin seeds"
    },
    {
      "amount": 1,
      "units": "tbsp",
      "name": "vegetable oil"
    },
    {
      "amount": 2,
      "name": "onions, finely chopped"
    },
    {
      "amount": 4,
      "units": "cloves",
      "name": "garlic, minced"
    },
    {
      "amount": 1,
      "units": "tbsp",
      "name": "dried oregano"
    },
    {
      "amount": 1,
      "units": "tsp",
      "name": "salt"
    },
    {
      "amount": 0.5,
      "units": "tsp",
      "name": "cracked black peppercorns"
    },
    {
      "amount": 1,
      "units": "28 oz can",
      "name": "tomatoes coarsely chopped"
    },
    {
      "amount": 1,
      "units": "cup",
      "name": "vegetable stock"
    },
    {
      "amount": 2,
      "units": "cans (29oz)",
      "name": "hominy, drained and rinsed"
    },
    {
      "amount": 1,
      "name": "lime zest and juice"
    },
    {
      "amount": 1,
      "name": "green bell pepper"
    },
    {
      "amount": 1,
      "name": "avocado"
    },
    {
      "amount": 0.25,
      "units": "cup",
      "name": "cilantro"
    }
  ],
  "instructions": "<ol><li>In heatproof bowl, soak dried chilies in boiling water for 30 minutes.  Drain and discard soaking liquid and stems. Set aside.</li><li>In a dry skillet, over medium-hight heat, toast pumpkin and cumin seeds, until pumpkin seeds are popping and cumin has released its aroma. Transfer to a small bowl and set aside.</li><li>In same skillet, heat oil over medium heat. Add onion and cook, stirring, until softened, about 3 minutes. </li><li>Add garlic, oregano, salt and peppercorns to onion and continue cooking for about 1 minute.</li><li>Transfer contents of skillet to a food processor or blender.  Add tomatoes with juice, reserved ancho peppers, pumpkin and cumin seeds and process until smooth.</li><li>In slow cooker stoneware, combine vegetable broth, tomato mixture and hominy.</li><li>Cover and cook on low for 6 to 8 hours or on high for 3 to 4 hours, until mixture is bubbling.</li><li>Stir in lime zest and juice and bell peppers. Cover and cook on high for 15 minutes, until peppers are tender.</li><li>Ladle into bowls and garnish, as desired with avocado and cilantro.</li></ol>Notes: You can partially make this dish the night before it is served.  Complete steps 1 and 2.  The next morning, continue cooking as directed in step 3."
}